app/controllers/users_controller.rb

INSERT INTO "users" ("mail", "created_at", "updated_at") VALUES (?, ?, ?)  [["mail", "adnan"], ["created_at", "2016-03-06 19:02:24.275833"], ["updated_at", "2016-03-06 19:02:24.275833"]]
---
  def mail
    @user = User.new(mail: params[:mail])
    if @user.save